Repository: whit3rabbit/turbospark
Catalog: swift/TurboSparkApp/Localization/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he, hi, id, it, ja, ko, nl, pl, pt_br, ru, sv, tr, uk, vi, zh_hans, zh_hant

source: Pinned user messages are added in transcript order, up to the token ceiling. Set the ceiling to zero to disable injection.
ar: تُضاف رسائل المستخدم المثبتة بترتيب المحادثة حتى حد الرموز. اضبط الحد على صفر لتعطيل الإضافة.
de: Angeheftete Benutzernachrichten werden in der Reihenfolge des Transkripts bis zum Token-Limit eingefügt. Setzen Sie das Limit auf null, um die Einfügung zu deaktivieren.
es: Los mensajes de usuario fijados se añaden en el orden de la transcripción hasta alcanzar el límite de tokens. Establece el límite en cero para desactivar la inclusión.
fr: Les messages utilisateur épinglés sont ajoutés dans l’ordre de la transcription, jusqu’à la limite de jetons. Réglez cette limite sur zéro pour désactiver l’injection.
he: הודעות משתמש מוצמדות מתווספות לפי סדר התמליל, עד לתקרת האסימונים. יש להגדיר את התקרה לאפס כדי להשבית הוספה.
hi: पिन किए गए उपयोगकर्ता संदेश बातचीत के क्रम में टोकन सीमा तक जोड़े जाते हैं। जोड़ना बंद करने के लिए सीमा शून्य करें।
id: Pesan pengguna yang disematkan ditambahkan sesuai urutan transkrip hingga batas token. Atur batas ke nol untuk menonaktifkan penyisipan.
it: I messaggi utente fissati vengono aggiunti nell’ordine della trascrizione, fino al limite di token. Imposta il limite a zero per disattivare l’inserimento.
ja: 固定したユーザーメッセージは、トークン上限に達するまで文字起こしの順に追加されます。追加を無効にするには、上限をゼロに設定します。
ko: 고정된 사용자 메시지는 토큰 한도까지 대화 기록 순서대로 추가됩니다. 추가를 끄려면 한도를 0으로 설정하세요.
nl: Vastgezette gebruikersberichten worden in transcriptvolgorde toegevoegd, tot aan de tokenlimiet. Stel de limiet in op nul om invoeging uit te schakelen.
pl: Przypięte wiadomości użytkownika są dodawane w kolejności transkryptu do limitu tokenów. Ustaw limit na zero, aby wyłączyć wstawianie.
pt_br: As mensagens de usuário fixadas são adicionadas na ordem da transcrição, até o limite de tokens. Defina o limite como zero para desativar a inclusão.
ru: Закрепленные сообщения пользователя добавляются в порядке стенограммы до лимита токенов. Установите лимит в ноль, чтобы отключить добавление.
sv: Fästa användarmeddelanden läggs till i transkriptordning upp till tokengränsen. Sätt gränsen till noll för att inaktivera infogning.
tr: Sabitlenmiş kullanıcı mesajları, belirteç sınırına kadar döküm sırasıyla eklenir. Eklemeyi kapatmak için sınırı sıfır yapın.
uk: Закріплені повідомлення користувача додаються в порядку транскрипту до ліміту токенів. Установіть нуль, щоб вимкнути додавання.
vi: Tin nhắn người dùng đã ghim được thêm theo thứ tự bản ghi, tối đa đến giới hạn token. Đặt giới hạn bằng không để tắt việc chèn.
zh_hans: 固定的用户消息会按对话记录顺序添加，直到达到令牌上限。将上限设为零可禁用注入。
zh_hant: 釘選的使用者訊息會依對話記錄順序加入，直到達到權杖上限。將上限設為零即可停用注入。

source: TurboSpark makes up to three follow-up requests when a response stops at the output limit.
ar: يرسل TurboSpark ما يصل إلى ثلاثة طلبات متابعة عندما يتوقف الرد عند حد الإخراج.
de: TurboSpark sendet bis zu drei Folgeanfragen, wenn eine Antwort am Ausgabelimit endet.
es: TurboSpark realiza hasta tres solicitudes adicionales si una respuesta se detiene al alcanzar el límite de salida.
fr: TurboSpark effectue jusqu’à trois requêtes supplémentaires lorsqu’une réponse s’arrête à la limite de sortie.
he: TurboSpark שולח עד שלוש בקשות המשך כשהתשובה נעצרת במגבלת הפלט.
hi: जवाब आउटपुट सीमा पर रुकने पर TurboSpark अधिकतम तीन अतिरिक्त अनुरोध करता है।
id: TurboSpark mengirim hingga tiga permintaan lanjutan saat jawaban berhenti pada batas keluaran.
it: TurboSpark invia fino a tre richieste successive se una risposta si interrompe al limite di output.
ja: 回答が出力上限で止まると、TurboSpark は最大 3 回まで追加リクエストを送信します。
ko: 응답이 출력 한도에서 멈추면 TurboSpark가 최대 세 번 추가 요청을 보냅니다.
nl: TurboSpark doet maximaal drie vervolgverzoeken wanneer een antwoord stopt bij de uitvoerlimiet.
pl: TurboSpark wysyła maksymalnie trzy kolejne żądania, gdy odpowiedź zatrzyma się na limicie wyjścia.
pt_br: O TurboSpark faz até três solicitações adicionais quando uma resposta para no limite de saída.
ru: TurboSpark отправляет до трех дополнительных запросов, если ответ останавливается на лимите вывода.
sv: TurboSpark gör upp till tre följdförfrågningar när ett svar stannar vid utmatningsgränsen.
tr: Bir yanıt çıktı sınırında durduğunda TurboSpark en fazla üç ek istek gönderir.
uk: TurboSpark надсилає до трьох додаткових запитів, коли відповідь зупиняється на ліміті виводу.
vi: TurboSpark gửi tối đa ba yêu cầu tiếp theo khi câu trả lời dừng ở giới hạn đầu ra.
zh_hans: 如果回答在输出达到上限时停止，TurboSpark 最多会再发送三次请求。
zh_hant: 如果回答在輸出達到上限時停止，TurboSpark 最多會再傳送三次請求。

source: Minimum token savings (64-4,096 tokens)
ar: الحد الأدنى لتوفير الرموز (64-4,096 رمزًا)
de: Minimale Token-Einsparung (64-4,096 Token)
es: Ahorro mínimo de tokens (64-4,096 tokens)
fr: Économie minimale de jetons (64-4,096 jetons)
he: חיסכון מינימלי באסימונים (64-4,096 אסימונים)
hi: न्यूनतम टोकन बचत (64-4,096 टोकन)
id: Penghematan token minimum (64-4,096 token)
it: Risparmio minimo di token (64-4,096 token)
ja: 最小トークン節約量 (64-4,096 トークン)
ko: 최소 토큰 절감량 (64-4,096 토큰)
nl: Minimale tokenbesparing (64-4,096 tokens)
pl: Minimalna oszczędność tokenów (64-4,096 tokenów)
pt_br: Economia mínima de tokens (64-4,096 tokens)
ru: Минимальная экономия токенов (64-4,096 токенов)
sv: Minsta tokenbesparing (64-4,096 token)
tr: En az belirteç tasarrufu (64-4,096 belirteç)
uk: Мінімальна економія токенів (64-4,096 токенів)
vi: Mức tiết kiệm token tối thiểu (64-4,096 token)
zh_hans: 最低令牌节省量 (64-4,096 个令牌)
zh_hant: 最低權杖節省量 (64-4,096 個權杖)

source: Maximum pinned instruction tokens (0-2,048 tokens)
ar: الحد الأقصى لرموز التعليمات المثبتة (0-2,048 رمزًا)
de: Maximale Tokenzahl für angeheftete Anweisungen (0-2,048 Token)
es: Máximo de tokens para instrucciones fijadas (0-2,048 tokens)
fr: Nombre maximal de jetons pour les instructions épinglées (0-2,048 jetons)
he: מספר האסימונים המרבי להוראות מוצמדות (0-2,048 אסימונים)
hi: पिन किए गए निर्देशों के अधिकतम टोकन (0-2,048 टोकन)
id: Maksimum token instruksi yang disematkan (0-2,048 token)
it: Numero massimo di token per le istruzioni fissate (0-2,048 token)
ja: 固定した指示の最大トークン数 (0-2,048 トークン)
ko: 고정된 지침의 최대 토큰 수 (0-2,048 토큰)
nl: Maximum aantal tokens voor vastgezette instructies (0-2,048 tokens)
pl: Maksymalna liczba tokenów przypiętych instrukcji (0-2,048 tokenów)
pt_br: Máximo de tokens para instruções fixadas (0-2,048 tokens)
ru: Максимум токенов для закрепленных инструкций (0-2,048 токенов)
sv: Maximalt antal token för fästa instruktioner (0-2,048 token)
tr: Sabitlenmiş talimatlar için en fazla belirteç (0-2,048 belirteç)
uk: Максимум токенів для закріплених інструкцій (0-2,048 токенів)
vi: Số token tối đa cho hướng dẫn đã ghim (0-2,048 token)
zh_hans: 固定指令的令牌上限 (0-2,048 个令牌)
zh_hant: 釘選指示的權杖上限 (0-2,048 個權杖)

source: User steer
ar: توجيه المستخدم
de: Nutzerhinweis
es: Indicación del usuario
fr: Instruction de l’utilisateur
he: הנחיית משתמש
hi: उपयोगकर्ता का निर्देश
id: Arahan pengguna
it: Indicazione dell’utente
ja: ユーザーからの指示
ko: 사용자 지시
nl: Gebruikersinstructie
pl: Wskazówka użytkownika
pt_br: Orientação do usuário
ru: Указание пользователя
sv: Anvisning från användaren
tr: Kullanıcı yönlendirmesi
uk: Вказівка користувача
vi: Chỉ dẫn của người dùng
zh_hans: 用户指示
zh_hant: 使用者指示

source: Coordinator steer
ar: توجيه المنسق
de: Koordinatorhinweis
es: Indicación del coordinador
fr: Instruction du coordinateur
he: הנחיית מתאם
hi: समन्वयक का निर्देश
id: Arahan koordinator
it: Indicazione del coordinatore
ja: コーディネーターからの指示
ko: 조정자 지시
nl: Coördinatorinstructie
pl: Wskazówka koordynatora
pt_br: Orientação do coordenador
ru: Указание координатора
sv: Anvisning från koordinatorn
tr: Koordinatör yönlendirmesi
uk: Вказівка координатора
vi: Chỉ dẫn của điều phối viên
zh_hans: 协调者指示
zh_hant: 協調者指示

source: Peer reply
ar: رد من نظير
de: Antwort eines Peers
es: Respuesta de un compañero
fr: Réponse d’un pair
he: תשובת עמית
hi: सहभागी का जवाब
id: Balasan rekan
it: Risposta di un pari
ja: ピアからの返信
ko: 동료 응답
nl: Reactie van een peer
pl: Odpowiedź równorzędnego agenta
pt_br: Resposta de um par
ru: Ответ участника
sv: Svar från en peer
tr: Eş yanıtı
uk: Відповідь колеги
vi: Phản hồi từ một phiên ngang hàng
zh_hans: 同级回复
zh_hant: 同儕回覆

source: Task notification
ar: إشعار مهمة
de: Aufgabenbenachrichtigung
es: Notificación de tarea
fr: Notification de tâche
he: התראת משימה
hi: कार्य सूचना
id: Notifikasi tugas
it: Notifica attività
ja: タスク通知
ko: 작업 알림
nl: Taakmelding
pl: Powiadomienie o zadaniu
pt_br: Notificação de tarefa
ru: Уведомление о задаче
sv: Uppgiftsavisering
tr: Görev bildirimi
uk: Сповіщення про завдання
vi: Thông báo tác vụ
zh_hans: 任务通知
zh_hant: 任務通知

source: Click
ar: انقر
de: Klicken
es: Hacer clic
fr: Cliquer
he: לחיצה
hi: क्लिक करें
id: Klik
it: Fai clic
ja: クリック
ko: 클릭
nl: Klikken
pl: Kliknij
pt_br: Clicar
ru: Нажать
sv: Klicka
tr: Tıkla
uk: Натиснути
vi: Nhấp
zh_hans: 点击
zh_hant: 點擊

source: Navigate
ar: تنقّل
de: Navigieren
es: Navegar
fr: Naviguer
he: ניווט
hi: नेविगेट करें
id: Navigasi
it: Naviga
ja: 移動
ko: 이동
nl: Navigeren
pl: Nawiguj
pt_br: Navegar
ru: Перейти
sv: Navigera
tr: Gezin
uk: Перейти
vi: Điều hướng
zh_hans: 导航
zh_hant: 導覽

source: Press Key
ar: اضغط مفتاحًا
de: Taste drücken
es: Pulsar tecla
fr: Appuyer sur une touche
he: הקש על מקש
hi: कुंजी दबाएँ
id: Tekan tombol
it: Premi un tasto
ja: キーを押す
ko: 키 누르기
nl: Toets indrukken
pl: Naciśnij klawisz
pt_br: Pressionar tecla
ru: Нажать клавишу
sv: Tryck på tangent
tr: Tuşa bas
uk: Натиснути клавішу
vi: Nhấn phím
zh_hans: 按键
zh_hant: 按鍵

source: Read Page
ar: قراءة الصفحة
de: Seite lesen
es: Leer página
fr: Lire la page
he: קריאת הדף
hi: पेज पढ़ें
id: Baca halaman
it: Leggi la pagina
ja: ページを読む
ko: 페이지 읽기
nl: Pagina lezen
pl: Czytaj stronę
pt_br: Ler página
ru: Читать страницу
sv: Läs sidan
tr: Sayfayı oku
uk: Читати сторінку
vi: Đọc trang
zh_hans: 阅读页面
zh_hant: 閱讀頁面

source: Screenshot
ar: لقطة شاشة
es: Captura de pantalla
fr: Capture d’écran
he: צילום מסך
hi: स्क्रीनशॉट
id: Tangkapan layar
ja: スクリーンショット
ko: 스크린샷
nl: Schermafbeelding
pl: Zrzut ekranu
pt_br: Captura de tela
ru: Снимок экрана
sv: Skärmbild
tr: Ekran görüntüsü
uk: Знімок екрана
vi: Ảnh chụp màn hình
zh_hans: 截图
zh_hant: 螢幕截圖

source: Scroll
ar: تمرير
de: Scrollen
es: Desplazar
fr: Faire défiler
he: גלילה
hi: स्क्रॉल करें
id: Gulir
it: Scorri
ja: スクロール
ko: 스크롤
nl: Scrollen
pl: Przewiń
pt_br: Rolar
ru: Прокрутить
sv: Rulla
tr: Kaydır
uk: Прокрутити
vi: Cuộn
zh_hans: 滚动
zh_hant: 捲動

source: Type
ar: اكتب
de: Eingeben
es: Escribir
fr: Saisir
he: הקלדה
hi: टाइप करें
id: Ketik
it: Digita
ja: 入力
ko: 입력
nl: Typen
pl: Wpisz
pt_br: Digitar
ru: Ввести
sv: Skriv
tr: Yaz
uk: Ввести
vi: Nhập
zh_hans: 输入
zh_hant: 輸入

source: Pin instruction
ar: تثبيت التعليمات
de: Anweisung anheften
es: Fijar instrucción
fr: Épingler l’instruction
he: נעיצת הוראה
hi: निर्देश पिन करें
id: Sematkan instruksi
it: Fissa istruzione
ja: 指示をピン留め
ko: 지침 고정
nl: Instructie vastzetten
pl: Przypnij instrukcję
pt_br: Fixar instrução
ru: Закрепить инструкцию
sv: Fäst instruktion
tr: Talimatı sabitle
uk: Закріпити інструкцію
vi: Ghim chỉ dẫn
zh_hans: 固定指令
zh_hant: 釘選指示

source: Some older tool output was shortened for this request.
ar: تم اختصار بعض مخرجات الأدوات القديمة لهذا الطلب.
de: Ältere Werkzeugausgaben wurden für diese Anfrage gekürzt.
es: Parte de los resultados antiguos de herramientas se acortó para esta solicitud.
fr: Une partie des anciens résultats d’outils a été raccourcie pour cette requête.
he: חלק מהפלטים הישנים של הכלים קוצרו עבור הבקשה הזו.
hi: इस अनुरोध के लिए पुराने टूल आउटपुट का कुछ हिस्सा छोटा किया गया।
id: Sebagian keluaran alat lama dipersingkat untuk permintaan ini.
it: Alcuni risultati precedenti degli strumenti sono stati abbreviati per questa richiesta.
ja: このリクエストのために古いツール出力の一部を短縮しました。
ko: 이 요청을 위해 이전 도구 출력의 일부를 줄였습니다.
nl: Een deel van oudere tooluitvoer is voor dit verzoek ingekort.
pl: Część starszych wyników narzędzi skrócono na potrzeby tego żądania.
pt_br: Alguns resultados antigos de ferramentas foram reduzidos para esta solicitação.
ru: Часть старых результатов инструментов была сокращена для этого запроса.
sv: Äldre verktygsresultat har kortats för den här begäran.
tr: Bu istek için eski araç çıktılarının bir kısmı kısaltıldı.
uk: Частину старих результатів інструментів скорочено для цього запиту.
vi: Một phần kết quả công cụ cũ đã được rút gọn cho yêu cầu này.
zh_hans: 为处理此请求，已缩短部分较早的工具输出。
zh_hant: 為處理此要求，已縮短部分較早的工具輸出。

source: Click a highlighted element to select it.
ar: انقر على العنصر المميز لتحديده.
de: Klicken Sie auf ein hervorgehobenes Element, um es auszuwählen.
es: Haz clic en un elemento resaltado para seleccionarlo.
fr: Cliquez sur un élément en surbrillance pour le sélectionner.
he: לחץ על רכיב מודגש כדי לבחור בו.
hi: चुनने के लिए हाइलाइट किए गए तत्व पर क्लिक करें।
id: Klik elemen yang disorot untuk memilihnya.
it: Fai clic su un elemento evidenziato per selezionarlo.
ja: 強調表示された要素をクリックして選択します。
ko: 강조 표시된 요소를 클릭하여 선택하세요.
nl: Klik op een gemarkeerd element om het te selecteren.
pl: Kliknij wyróżniony element, aby go wybrać.
pt_br: Clique em um elemento destacado para selecioná-lo.
ru: Нажмите выделенный элемент, чтобы выбрать его.
sv: Klicka på ett markerat element för att välja det.
tr: Seçmek için vurgulanan öğeye tıklayın.
uk: Натисніть виділений елемент, щоб вибрати його.
vi: Nhấp vào phần tử được tô sáng để chọn.
zh_hans: 点击高亮元素以选择它。
zh_hant: 點擊反白的元素以選取。

source: Unpin instruction
ar: إلغاء تثبيت التعليمات
de: Anweisung lösen
es: Desfijar instrucción
fr: Désépingler l’instruction
he: ביטול נעיצת הוראה
hi: निर्देश अनपिन करें
id: Lepas sematan instruksi
it: Rimuovi istruzione fissata
ja: 指示のピン留めを解除
ko: 지침 고정 해제
nl: Instructie losmaken
pl: Odepnij instrukcję
pt_br: Desafixar instrução
ru: Открепить инструкцию
sv: Ta bort fäst instruktion
tr: Talimatın sabitlemesini kaldır
uk: Відкріпити інструкцію
vi: Bỏ ghim chỉ dẫn
zh_hans: 取消固定指令
zh_hant: 取消釘選指示

source: Incomplete tool call, not executed
ar: استدعاء أداة غير مكتمل، ولم يتم تنفيذه
de: Unvollständiger Werkzeugaufruf, nicht ausgeführt
es: Llamada a herramienta incompleta, no ejecutada
fr: Appel d’outil incomplet, non exécuté
he: קריאת כלי לא הושלמה ולא בוצעה
hi: अधूरा टूल कॉल, निष्पादित नहीं किया गया
id: Pemanggilan alat tidak lengkap, tidak dijalankan
it: Chiamata allo strumento incompleta, non eseguita
ja: 未完了のツール呼び出し、未実行
ko: 불완전한 도구 호출, 실행되지 않음
nl: Onvolledige toolaanroep, niet uitgevoerd
pl: Niekompletne wywołanie narzędzia, niewykonane
pt_br: Chamada de ferramenta incompleta, não executada
ru: Незавершенный вызов инструмента, не выполнен
sv: Ofullständigt verktygsanrop, inte utfört
tr: Tamamlanmamış araç çağrısı, yürütülmedi
uk: Незавершений виклик інструмента, не виконано
vi: Lời gọi công cụ chưa hoàn tất, chưa được thực thi
zh_hans: 未完成的工具调用，未执行
zh_hant: 未完成的工具呼叫，未執行

source: Rows shortened
ar: الصفوف المختصرة
de: Gekürzte Zeilen
es: Filas acortadas
fr: Lignes raccourcies
he: שורות שקוצרו
hi: छोटी की गई पंक्तियाँ
id: Baris yang dipersingkat
it: Righe abbreviate
ja: 短縮した行
ko: 줄인 행
nl: Ingekorte regels
pl: Skrócone wiersze
pt_br: Linhas encurtadas
ru: Сокращённые строки
sv: Förkortade rader
tr: Kısaltılan satırlar
uk: Скорочені рядки
vi: Các dòng đã rút gọn
zh_hans: 已缩短的行
zh_hant: 已縮短的列

source: Estimated tokens saved
ar: الرموز المقدّر توفيرها
de: Geschätzte eingesparte Tokens
es: Tokens ahorrados estimados
fr: Tokens économisés estimés
he: מספר האסימונים שנחסכו, בהערכה
hi: अनुमानित बचाए गए टोकन
id: Perkiraan token yang dihemat
it: Token risparmiati stimati
ja: 推定節約トークン数
ko: 예상 절약 토큰 수
nl: Geschat aantal bespaarde tokens
pl: Szacowana liczba zaoszczędzonych tokenów
pt_br: Tokens economizados estimados
ru: Примерно сэкономлено токенов
sv: Uppskattat antal sparade token
tr: Tahmini tasarruf edilen token
uk: Орієнтовно заощаджено токенів
vi: Số token tiết kiệm ước tính
zh_hans: 预计节省的令牌
zh_hant: 預估節省的 Token

source: Pick Element
ar: اختر عنصرًا
de: Element auswählen
es: Seleccionar elemento
fr: Sélectionner un élément
he: בחירת רכיב
hi: तत्व चुनें
id: Pilih Elemen
it: Seleziona elemento
ja: 要素を選択
ko: 요소 선택
nl: Element selecteren
pl: Wybierz element
pt_br: Selecionar elemento
ru: Выбрать элемент
sv: Välj element
tr: Öğe seç
uk: Вибрати елемент
vi: Chọn phần tử
zh_hans: 选择元素
zh_hant: 選取元素

source: This element changed. Pick it again.
ar: تغير هذا العنصر. حدده مرة أخرى.
de: Dieses Element hat sich geändert. Wählen Sie es erneut aus.
es: Este elemento cambió. Selecciónalo de nuevo.
fr: Cet élément a changé. Sélectionnez-le à nouveau.
he: הרכיב השתנה. בחר אותו שוב.
hi: यह तत्व बदल गया है। इसे फिर से चुनें।
id: Elemen ini berubah. Pilih lagi.
it: Questo elemento è cambiato. Selezionalo di nuovo.
ja: この要素は変更されました。もう一度選択してください。
ko: 이 요소가 변경되었습니다. 다시 선택하세요.
nl: Dit element is gewijzigd. Selecteer het opnieuw.
pl: Ten element się zmienił. Wybierz go ponownie.
pt_br: Este elemento mudou. Selecione-o novamente.
ru: Этот элемент изменился. Выберите его снова.
sv: Det här elementet har ändrats. Välj det igen.
tr: Bu öğe değişti. Yeniden seçin.
uk: Цей елемент змінився. Виберіть його ще раз.
vi: Phần tử này đã thay đổi. Hãy chọn lại.
zh_hans: 此元素已更改。请重新选择。
zh_hant: 此元素已變更。請重新選取。

source: Recovery events
ar: أحداث الاسترداد
de: Wiederherstellungsereignisse
es: Eventos de recuperación
fr: Événements de récupération
he: אירועי שחזור
hi: पुनर्प्राप्ति घटनाएँ
id: Peristiwa pemulihan
it: Eventi di ripristino
ja: 復旧イベント
ko: 복구 이벤트
nl: Herstelgebeurtenissen
pl: Zdarzenia odzyskiwania
pt_br: Eventos de recuperação
ru: События восстановления
sv: Återställningshändelser
tr: Kurtarma olayları
uk: Події відновлення
vi: Sự kiện khôi phục
zh_hans: 恢复事件
zh_hant: 復原事件

source: Generation continued. Attempt: %lld, tokens so far: %lld.
ar: تمت متابعة التوليد. المحاولة: %lld، الرموز حتى الآن: %lld.
de: Generierung fortgesetzt. Versuch: %lld, bisherige Tokens: %lld.
es: Generación continuada. Intento: %lld, tokens hasta ahora: %lld.
fr: Génération poursuivie. Tentative : %lld, jetons jusqu’ici : %lld.
he: היצירה נמשכה. ניסיון: %lld, אסימונים עד כה: %lld.
hi: जनरेशन जारी रहा। प्रयास: %lld, अब तक टोकन: %lld.
id: Generasi dilanjutkan. Percobaan: %lld, total token sejauh ini: %lld.
it: Generazione continuata. Tentativo: %lld, token finora: %lld.
ja: 生成を続行しました。試行回数: %lld、これまでのトークン数: %lld。
ko: 생성을 계속했습니다. 시도: %lld, 현재까지 토큰: %lld.
nl: Generatie voortgezet. Poging: %lld, tot nu toe %lld tokens.
pl: Generowanie wznowione. Próba: %lld, dotychczas tokenów: %lld.
pt_br: Geração continuada. Tentativa: %lld, tokens até agora: %lld.
ru: Генерация продолжена. Попытка: %lld, токенов на данный момент: %lld.
sv: Genereringen fortsatte. Försök: %lld, token hittills: %lld.
tr: Üretim sürdürüldü. Deneme: %lld, şimdiye kadarki belirteç: %lld.
uk: Генерацію продовжено. Спроба: %lld, токенів наразі: %lld.
vi: Đã tiếp tục tạo. Lần thử: %lld, tổng số token đến nay: %lld.
zh_hans: 已继续生成。尝试次数：%lld，当前令牌数：%lld。
zh_hant: 已繼續生成。嘗試次數：%lld，目前權杖數：%lld。

source: Partial response preserved. Rows: %lld.
ar: تم الاحتفاظ بالرد الجزئي. الصفوف: %lld.
de: Teilantwort gespeichert. Zeilen: %lld.
es: Respuesta parcial conservada. Filas: %lld.
fr: Réponse partielle conservée. Lignes : %lld.
he: התגובה החלקית נשמרה. שורות: %lld.
hi: आंशिक उत्तर सुरक्षित रखा गया। पंक्तियाँ: %lld.
id: Sebagian respons dipertahankan. Baris: %lld.
it: Risposta parziale conservata. Righe: %lld.
ja: 部分応答を保存しました。行数: %lld。
ko: 부분 응답을 보존했습니다. 행: %lld.
nl: Gedeeltelijk antwoord bewaard. Regels: %lld.
pl: Zachowano częściową odpowiedź. Wiersze: %lld.
pt_br: Resposta parcial preservada. Linhas: %lld.
ru: Частичный ответ сохранён. Строк: %lld.
sv: Delvis svar bevarat. Rader: %lld.
tr: Kısmi yanıt korundu. Satır: %lld.
uk: Часткову відповідь збережено. Рядків: %lld.
vi: Đã giữ lại câu trả lời một phần. Số dòng: %lld.
zh_hans: 已保留部分回复。行数：%lld。
zh_hant: 已保留部分回覆。列數：%lld。

source: Generated tail discarded: %@.
ar: تم تجاهل الذيل المُولّد: %@.
de: Generierter Rest verworfen: %@.
es: Se descartó la parte final generada: %@.
fr: Fin générée ignorée : %@.
he: החלק האחרון שנוצר הושלך: %@.
hi: जनरेट किया गया अंतिम भाग छोड़ दिया गया: %@.
id: Bagian akhir yang dihasilkan dibuang: %@.
it: Parte finale generata scartata: %@.
ja: 生成された末尾を破棄しました: %@。
ko: 생성된 꼬리 부분을 버렸습니다: %@.
nl: Gegenereerd laatste deel verworpen: %@.
pl: Odrzucono wygenerowaną końcówkę: %@.
pt_br: Trecho final gerado descartado: %@.
ru: Сгенерированный хвост отброшен: %@.
sv: Genererad slutdel kastades bort: %@.
tr: Üretilen son bölüm atıldı: %@.
uk: Згенерований хвіст відкинуто: %@.
vi: Đã loại bỏ phần cuối được tạo: %@.
zh_hans: 已丢弃生成的尾部内容：%@。
zh_hant: 已捨棄生成的尾端內容：%@。

source: Generated tail was discarded for an unspecified reason.
ar: تم تجاهل الذيل المُولّد لعدم تحديد السبب.
de: Der generierte Rest wurde aus einem nicht näher bezeichneten Grund verworfen.
es: Se descartó la parte final generada por un motivo no especificado.
fr: La fin générée a été ignorée pour un motif non précisé.
he: החלק האחרון שנוצר הושלך מסיבה שלא צוינה.
hi: कारण निर्दिष्ट न होने के कारण जनरेट किया गया अंतिम भाग छोड़ दिया गया।
id: Bagian akhir yang dihasilkan dibuang karena alasan yang tidak ditentukan.
it: La parte finale generata è stata scartata per un motivo non specificato.
ja: 生成された末尾は、理由が指定されていないため破棄されました。
ko: 생성된 꼬리 부분은 이유가 지정되지 않아 버렸습니다.
nl: Het gegenereerde laatste deel is om een niet-opgegeven reden verworpen.
pl: Wygenerowaną końcówkę odrzucono z nieokreślonego powodu.
pt_br: O trecho final gerado foi descartado por um motivo não especificado.
ru: Сгенерированный хвост отброшен по неуказанной причине.
sv: Den genererade slutdelen kastades bort av en ospecificerad anledning.
tr: Üretilen son bölüm, belirtilmemiş bir nedenle atıldı.
uk: Згенерований хвіст відкинуто з невказаної причини.
vi: Phần cuối được tạo đã bị loại bỏ vì không có lý do cụ thể.
zh_hans: 由于未提供原因，已丢弃生成的尾部内容。
zh_hant: 由於未提供原因，已捨棄生成的尾端內容。

source: Recovery anchor recorded. Retained messages: %lld, retries used: %lld.
ar: تم تسجيل نقطة الاسترداد. الرسائل المحتفظ بها: %lld، مرات إعادة المحاولة المستخدمة: %lld.
de: Wiederherstellungspunkt gespeichert. Beibehaltene Nachrichten: %lld, verwendete Wiederholungen: %lld.
es: Se registró el ancla de recuperación. Mensajes conservados: %lld, reintentos usados: %lld.
fr: Repère de récupération enregistré. Messages conservés : %lld, nouvelles tentatives utilisées : %lld.
he: נקודת השחזור נרשמה. הודעות שנשמרו: %lld, ניסיונות חוזרים שנוצלו: %lld.
hi: पुनर्प्राप्ति एंकर दर्ज किया गया। सुरक्षित संदेश: %lld, उपयोग किए गए पुनः प्रयास: %lld.
id: Penanda pemulihan dicatat. Pesan yang dipertahankan: %lld, percobaan ulang yang digunakan: %lld.
it: Punto di ripristino registrato. Messaggi conservati: %lld, tentativi usati: %lld.
ja: 復旧アンカーを記録しました。保持したメッセージ: %lld、使用済み再試行: %lld。
ko: 복구 기준점을 기록했습니다. 보존된 메시지: %lld, 사용한 재시도: %lld.
nl: Herstelpunt vastgelegd. Behouden berichten: %lld, gebruikte nieuwe pogingen: %lld.
pl: Zapisano punkt odzyskiwania. Zachowane wiadomości: %lld, użyte ponowienia: %lld.
pt_br: Âncora de recuperação registrada. Mensagens mantidas: %lld, novas tentativas usadas: %lld.
ru: Точка восстановления сохранена. Сохранено сообщений: %lld, использовано повторов: %lld.
sv: Återställningsankare registrerat. Bevarade meddelanden: %lld, använda omförsök: %lld.
tr: Kurtarma bağlantı noktası kaydedildi. Korunan iletiler: %lld, kullanılan yeniden denemeler: %lld.
uk: Точку відновлення записано. Збережено повідомлень: %lld, використано повторів: %lld.
vi: Đã ghi nhận mốc khôi phục. Số tin nhắn giữ lại: %lld, số lần thử lại đã dùng: %lld.
zh_hans: 已记录恢复锚点。保留的消息：%lld，已用重试次数：%lld。
zh_hant: 已記錄復原錨點。保留的訊息：%lld，已用重試次數：%lld。
